In [21]:
import mysql.connector as sql
import pandas as pd

# auth_plugin is needed, can check by commends 
# SELECT user,authentication_string,plugin,host FROM mysql.user;
# check the columns plugin and user

mydb = sql.connect (
    host = "localhost",
    user = "root",
    password = "ZAQs8271911c$",
    auth_plugin='mysql_native_password',
    database = "sql_intro",
    buffered = True             # Unread result found issue
)                                              # if using pandas no need to use buffer

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7f15f09e61a0>

In [7]:
# only execute sql query wo passing data to panda dataframe
mycoursor = mydb.cursor()

mycoursor.execute(
    """
    #! create database
    create database if not exists database_name;
    """
)

# using pandas to run sql query and get data into dataframe

In [11]:
# only execute sql query wo passing data to panda dataframe 
sql_query = """
select Name, doj, salary
from emp_details;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     Name         doj   salary
0   Jimmy  2005-05-30  70000.0
1   Shane  1999-06-25  55000.0
2   Marry  2009-03-10  62000.0
3  Dwayne  2011-07-12  57000.0
4    Sara  2017-10-27  72000.0
5    Ammy  2014-12-20  80000.0

# using for loop for reading data

In [28]:
cursor = mydb.cursor()
sql_query = """
select * 
from emp_details;
"""
# execute sql query
cursor.execute(sql_query)

#using for loop for reading data
for x in cursor:
    #print(type(x))
    print(x)   #<class 'tuple'>

('Jimmy', 35, 'M', datetime.date(2005, 5, 30), 'Chicago', 70000.0)
('Shane', 30, 'M', datetime.date(1999, 6, 25), 'Seattle', 55000.0)
('Marry', 28, 'F', datetime.date(2009, 3, 10), 'Boston', 62000.0)
('Dwayne', 37, 'M', datetime.date(2011, 7, 12), 'Austin', 57000.0)
('Sara', 32, 'F', datetime.date(2017, 10, 27), 'New York', 72000.0)
('Ammy', 35, 'F', datetime.date(2014, 12, 20), 'Seattle', 80000.0)

# second way of passing data to panda dataframe

In [31]:
cursor = mydb.cursor()
sql_query = """
select * 
from emp_details;
"""

cursor.execute(sql_query)

table_rows = cursor.fetchall()

df = pd.DataFrame(table_rows)
df

        0   1  2           3         4        5
0   Jimmy  35  M  2005-05-30   Chicago  70000.0
1   Shane  30  M  1999-06-25   Seattle  55000.0
2   Marry  28  F  2009-03-10    Boston  62000.0
3  Dwayne  37  M  2011-07-12    Austin  57000.0
4    Sara  32  F  2017-10-27  New York  72000.0
5    Ammy  35  F  2014-12-20   Seattle  80000.0